Revit 2027 API
NumberingSchema.GetNumberingSequences Method
 Returns all numbering sequences within this numbering schema.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<string> GetNumberingSequences()
Public Function GetNumberingSequences As IList(Of String)
public:
IList<String^>^ GetNumberingSequences()
member GetNumberingSequences : unit -> IList<string>
Return Value
IList<String>
 A collection of partition names of all numbering sequences currently present in this schema.
Remarks
 The collection may be empty if there are no elements yet in this schema. One of the strings can be an empty string, which would indicate presence of the default partition into which elements automatically belong if left unassigned to any other partition
See Also
Reference
NumberingSchema Class
Autodesk.Revit.DB Namespace